_posts/2014-10-13-Navigating-your-bibtex-file.html
---
title: Navigating your bibtex file
date: 2014/10/13 10:22:27
updated: 2014/10/13 10:22:27
categories: bibtex
tags: 
---



<p>
You may be able to tell I am spending some time cleaning up bibtex files these days. One of the things I need to do is navigate around a bibtex file easily. There are some built-in navigation keys within an entry.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">navigation</th>
<th scope="col" class="left">key strokes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">next field</td>
<td class="left">C-j</td>
</tr>

<tr>
<td class="left">end of field</td>
<td class="left">TAB</td>
</tr>

<tr>
<td class="left">beginning of entry</td>
<td class="left">C-M-a</td>
</tr>

<tr>
<td class="left">end of entry</td>
<td class="left">C-M-e</td>
</tr>
</tbody>
</table>

<p>
I am not aware of an easy way to navigate to the next or previous entry though. I would like something simple to do that. There is a regexp defined in bibtex "bibtex-entry-head", to search for the next or previous entry.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">bibtex-entry-head
</pre>
</div>

<pre class="example">
^[      ]*\(@[  ]*\(?:\(?:Article\|Book\(?:let\)?\|In\(?:Book\|Collection\|Proceedings\)\|M\(?:a\(?:nual\|stersThesis\)\|isc\)\|P\(?:\(?:hdThesi\|roceeding\)s\)\|TechReport\|Unpublished\)\)\)[        ]*[({][         
]*\([][[:alnum:].:;?!`'/*@+|()&lt;&gt;&amp;_^$-]+\)
</pre>

<p>
Here are two functions that do it. This was a little more subtle than I anticipated.  The subtlety comes about if you are at the beginning of the entry, we need to move the cursor by a character, and then search forward because of the way re-search-forward works. I also wrote in an option for a prefix argument, so you can go forward or backward several entries.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">bibtex-next-entry</span> (<span style="color: #4682b4;">&amp;optional</span> n)
  <span style="color: #228b22;">"Jump to the beginning of the next bibtex entry. N is a prefix</span>
<span style="color: #228b22;">argument. If it is numeric, jump that many entries</span>
<span style="color: #228b22;">forward. Negative numbers do nothing."</span>
  (interactive <span style="color: #228b22;">"P"</span>)
  ;; <span style="color: #ff0000; font-weight: bold;">Note if we start at the beginning of an entry, nothing</span>
  ;; <span style="color: #ff0000; font-weight: bold;">happens. We need to move forward a char, and call again.</span>
  (<span style="color: #8b0000;">when</span> (= (point) (<span style="color: #8b0000;">save-excursion</span>
                     (bibtex-beginning-of-entry)))
    (forward-char)
    (bibtex-next-entry))

  ;; <span style="color: #ff0000; font-weight: bold;">search forward for an entry </span>
  (<span style="color: #8b0000;">when</span> 
      (re-search-forward bibtex-entry-head nil t (and (numberp n) n))
    ;; <span style="color: #ff0000; font-weight: bold;">go to beginning of the entry</span>
    (bibtex-beginning-of-entry)))


(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">bibtex-previous-entry</span> (<span style="color: #4682b4;">&amp;optional</span> n)
  <span style="color: #228b22;">"Jump to beginning of the previous bibtex entry. N is a prefix</span>
<span style="color: #228b22;">argument. If it is numeric, jump that many entries back."</span>
  (interactive <span style="color: #228b22;">"P"</span>)
  (bibtex-beginning-of-entry)
 (<span style="color: #8b0000;">when</span> 
     (re-search-backward bibtex-entry-head nil t (and (numberp n) n))
   (bibtex-beginning-of-entry)))
</pre>
</div>

<pre class="example">
bibtex-previous-entry
</pre>

<p>
That is pretty simple. Let us go ahead and bind these to M-n, and M-p, but only in bibtex-mode. Thanks to <a href="http://ergoemacs.org/emacs/emacs_set_keys_for_major_mode.html">Xah Lee</a> for this idea. 
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">jmax-bibtex-mode-keys</span> ()
  <span style="color: #228b22;">"Modify keymaps used by `</span><span style="color: #cd0000;">bibtex-mode</span><span style="color: #228b22;">'."</span>
  (local-set-key (kbd <span style="color: #228b22;">"M-n"</span>) 'bibtex-next-entry)
  (local-set-key (kbd <span style="color: #228b22;">"M-p"</span>) 'bibtex-previous-entry))

;; <span style="color: #ff0000; font-weight: bold;">add to bibtex-mode-hook</span>
(add-hook 'bibtex-mode-hook 'jmax-bibtex-mode-keys)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">jmax-bibtex-mode-keys</td>
</tr>
</tbody>
</table>

<p>
Now, C-n moves forward an entry, C-u 2 C-n moves you two entries, etc&#x2026; and C-p moves you back an entry, while C-u 2 C-p moves you back two entries. 
</p>

<p>
Finally, I sometimes want to jump to a field in an entry. Basically, I want a completion enabled function that lists the fields in the current entry, and then jumps to the selected field. Yes, you could simply do an incremental search forward or backward that is about as simple. But, then I would not get to remind myself how to do a completion command ;)
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">jmax-bibtex-get-fields</span> ()
  <span style="color: #228b22;">"Get a list of fields in a bibtex entry."</span>
  (bibtex-beginning-of-entry)
  (remove <span style="color: #228b22;">"=type="</span>
          (remove <span style="color: #228b22;">"=key="</span>
                  (mapcar 'car (bibtex-parse-entry)))))

(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">jmax-bibtex-jump-to-field</span> (field)
  <span style="color: #228b22;">"Jump to FIELD in the current bibtex entry"</span>
  (interactive
   (list
    (ido-completing-read <span style="color: #228b22;">"Field: "</span> (jmax-bibtex-get-fields))))
  (<span style="color: #8b0000;">save-restriction</span>
    (bibtex-narrow-to-entry)
    (bibtex-beginning-of-entry)
    (<span style="color: #8b0000;">when</span>
        ;; <span style="color: #ff0000; font-weight: bold;">fields start with spaces, a field name, possibly more</span>
        ;; <span style="color: #ff0000; font-weight: bold;">spaces, then =</span>
        (re-search-forward (format <span style="color: #228b22;">"^\\s-*%s\\s-*="</span> field) nil t))))
</pre>
</div>

<pre class="example">
jmax-bibtex-jump-to-field
</pre>

<p>
These functions live in <a href="https://github.com/jkitchin/jmax/blob/master/jmax-bibtex.el">https://github.com/jkitchin/jmax/blob/master/jmax-bibtex.el</a> , which is the version we use on a regular basis.
</p>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/10/13/Navigating-your-bibtex-file.org">org-mode source</a><p><p>Org-mode version = 8.2.7c</p>